
## :white_check_mark: Apply Succeeded (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/22845)



<pre><code>Apply complete! Resources: 8 added, 3 changed, 6 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0: Refreshing state... [id=P5VWU4J]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8: Refreshing state... [id=PTQTW8M]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715: Refreshing state... [id=PPE5VWZ]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7: Refreshing state... [id=P94HUH9]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserMerge-Rule-Rule]
aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic]
aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic]
aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic]
aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical]
aws_sns_topic.list-api-events_list-event-topic_8792A1B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic]
aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus]
aws_sns_topic.collection-events_collection-event-topic_343F754D: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic]
aws_sns_topic.adm-events_user-merge-topic_59FD8EDC: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic]
data.aws_sqs_queue.prospect-events_prospect-Prod-dlq_CF630359: Reading...
data.aws_sqs_queue.prospect-events_prospect-Prod-dlq_CF630359: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue-Deadletter]
aws_sqs_queue.user-registration_sns-topic-dql_811A5411: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ]
aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60: Refreshing state... [id=queue-check-delete/PocketEventBus]
aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33: Refreshing state... [id=user-events/PocketEventBus]
aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ]
aws_sns_topic.user-api-events_user-event-topic_BF85AC87: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic]
aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D: Refreshing state... [id=Forgot-Password-Request/PocketEventBus]
aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ]
data.terraform_remote_state.incident_management: Read complete after 0s
aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3: Refreshing state... [id=User-Registration-Event/PocketEventBus]
aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-PremiumPurchase-Rule-Rule]
aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical]
aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B: Refreshing state... [id=user-merge/PocketEventBus]
aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic]
aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue-dlq_C3DDC925: Reading...
aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserMerge-SNS-Topic-DLQ]
aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_99FC7731: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserRegistration-Rule-Rule]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue-dlq_C3DDC925: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue-Deadletter]
aws_sns_topic.user-registration_user-registration-topic_1A7AE012: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue_36538BB9: Reading...
aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419: Refreshing state... [id=Premium-Renewal-Upcoming/PocketEventBus]
data.aws_sqs_queue.adm-events_AccountDeleteMonitor-Prod-queue_36538BB9: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue]
aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59: Refreshing state... [id=Premium-Purchase/PocketEventBus]
aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227: Refreshing state... [id=PocketEventBridge-Prod-EventTracker-Rule-Rule]
aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ]
data.aws_sqs_queue.prospect-events_prospect-Prod-queue_79FEB8DA: Reading...
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_DD089E8F: Reading...
data.aws_sqs_queue.prospect-events_prospect-Prod-queue_79FEB8DA: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_9EB3E664: Reading...
data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_DD089E8F: Read complete after 0s [id=3384957766]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_9EB3E664: Read complete after 0s [id=308215119]
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Prod-EventBridge-SNS-Policy_ABFB117B: Reading...
data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Prod-EventBridge-SNS-Policy_ABFB117B: Read complete after 1s [id=2945242189]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule]
aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ListApiEvents-Rule-Rule]
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Refreshing state... [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_4810C8AC: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserEvents-Rule-Rule]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_87C8D81F: Reading...
aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-CollectionEvents-Rule-Rule]
data.aws_iam_policy_document.list-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_87C8D81F: Read complete after 0s [id=1040146387]
aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ProspectEvents-Rule-Rule]
aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListEvents-Rule-Rule]
aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120: Refreshing state... [id=PocketEventBridge-Prod-ProspectEvents-Rule-DLQ-Alarm]
data.aws_iam_policy_document.collection-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_71D8FE56: Reading...
data.aws_iam_policy_document.collection-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_71D8FE56: Read complete after 0s [id=209579824]
data.aws_iam_policy_document.adm-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_69DF8795: Reading...
data.aws_iam_policy_document.adm-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_69DF8795: Read complete after 0s [id=2151299890]
null_resource.adm-events_null-resource_C7D19F6F: Refreshing state... [id=5907751578904588335]
aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2: Refreshing state... [id=PocketEventBridge-Prod-PremiumPurchase-rule-dlq-alarm]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_CC884446: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PH8FGF4]
data.aws_iam_policy_document.user-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_CC884446: Read complete after 0s [id=144708017]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PDZUG2E]
null_resource.premium-purchase_null-resource_E2C3B0AC: Refreshing state... [id=8590974618707730681]
aws_cloudwatch_event_target.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-PremiumPurchase-SNS-Target_A8F33A09: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-PremiumPurchase-Rule-Rule-PocketEventBridge-Prod-PremiumPurchase-SNS-Target]
aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F: Refreshing state... [id=PocketEventBridge-Prod-ListApiEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_01EB0FFC: Reading...
aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3: Refreshing state... [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-prod-dlq-alarm_D899FDCA: Refreshing state... [id=PocketEventBridge-Prod-PocketEventBridge-Prod-Dlq-Alarm]
aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78: Refreshing state... [id=PocketEventBridge-Prod-UserEvents-Rule-dlq-alarm]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-UserMerge-Rule-Target_7DE5DC1D: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserMerge-Rule-Rule-AccountDeleteMonitor-Prod-UserMerge-Rule-Target]
data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_01EB0FFC: Read complete after 0s [id=2073910124]
data.aws_iam_policy_document.user-registration_PocketEventBridge-Prod-EventBridge-SNS-Policy_85B528ED: Reading...
null_resource.user-registration_null-resource_B04CACC3: Refreshing state... [id=1347031598725150988]
data.aws_iam_policy_document.user-registration_PocketEventBridge-Prod-EventBridge-SNS-Policy_85B528ED: Read complete after 0s [id=509125882]
aws_cloudwatch_event_target.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Registration-Event-SNS-Target_D5B6ADE6: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserRegistration-Rule-Rule-PocketEventBridge-Prod-User-Registration-Event-SNS-Target]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-Prospect-Event-SQS-Policy_78EDEA17: Reading...
aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D: Refreshing state... [id=PocketEventBridge-Prod-CollectionEvents-Rule-dlq-alarm]
data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-Prospect-Event-SQS-Policy_78EDEA17: Read complete after 0s [id=245579235]
aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic]
aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-EventTracker-Rule-Target_AF1CF51A: Refreshing state... [id=PocketEventBridge-Prod-EventTracker-Rule-Rule-AccountDeleteMonitor-Prod-EventTracker-Rule-Target]
aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic]
aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic]
aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic]
aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic]
null_resource.prospect-events_null-resource_BF542108: Refreshing state... [id=1286103112814733777]
null_resource.list-api-events_null-resource_D711C801: Refreshing state... [id=1177664838478028438]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SNS-Target_CC89DADA: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-SNS-Target]
aws_cloudwatch_event_target.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-List-Event-SNS-Target_FD139C52: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ListApiEvents-Rule-Rule-PocketEventBridge-Prod-List-Event-SNS-Target]
aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic]
null_resource.collection-events_null-resource_9F908E27: Refreshing state... [id=7083867980005228814]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target_C4F47897: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ProspectEvents-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target]
aws_cloudwatch_event_target.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_C4E7E46F: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-CollectionEvents-Rule-Rule-PocketEventBridge-Prod-Collection-Event-SNS-Target]
aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic]
aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SQS-Target_649F5585: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ProspectEvents-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-SQS-Target]
aws_cloudwatch_event_target.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Event-SNS-Target_9A50990C: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserEvents-Rule-Rule-PocketEventBridge-Prod-User-Event-SNS-Target]
null_resource.user-api-events_null-resource_C0C836FA: Refreshing state... [id=4119566737246291003]
aws_cloudwatch_event_target.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target_D0F547B9: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ShareableListEvents-Rule-Rule-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target]
null_resource.shareable-list-events_null-resource_78AB9CC2: Refreshing state... [id=7244420153938391428]
aws_cloudwatch_event_target.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target_84030FFD: Refreshing state... [id=PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target]
null_resource.shareable-list-item-events_null-resource_46056FE2: Refreshing state... [id=7377342030826013425]
aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE: Refreshing state... [id=arn:aws:sns:us-east-

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

rod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_collectionevents_snstopicdql_6B11F7F7 has moved to aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3
    resource "aws_sqs_queue" "collection-events_sns-topic-dql_48DE5FA3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_listapievents_snstopicdql_0098EEA6 has moved to aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54
    resource "aws_sqs_queue" "list-api-events_sns-topic-dql_ED0C2F54" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_premiumpurchase_snstopicdlq_1949C943 has moved to aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E
    resource "aws_sqs_queue" "premium-purchase_sns-topic-dlq_2D01673E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_shareablelistevents_snstopicdql_49BECACA has moved to aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3
    resource "aws_sqs_queue" "shareable-list-events_sns-topic-dql_91DFF5B3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_shareablelistitemevents_snstopicdql_D0F47B59 has moved to aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F
    resource "aws_sqs_queue" "shareable-list-item-events_sns-topic-dql_44435A2F" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_userapievents_snstopicdql_A0F6EC9F has moved to aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53
    resource "aws_sqs_queue" "user-api-events_sns-topic-dql_D6161F53" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_userregistration_snstopicdql_5EDA4814 has moved to aws_sqs_queue.user-registration_sns-topic-dql_811A5411
    resource "aws_sqs_queue" "user-registration_sns-topic-dql_811A5411" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ"
        name                              = "PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.pocketeventbridge_prospectevents_prospecteventssqspolicy_B5651E17 has moved to aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E
    resource "aws_sqs_queue_policy" "prospect-events_prospect-events-sqs-policy_5D878A3E" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue"
        # (2 unchanged attributes hidden)
    }

  # null_resource.pocketeventbridge_admevents_nullresource_582607DC has moved to null_resource.adm-events_null-resource_C7D19F6F
    resource "null_resource" "adm-events_null-resource_C7D19F6F" {
        id = "5907751578904588335"
    }

  # null_resource.pocketeventbridge_collectionevents_nullresource_DC135E6D has moved to null_resource.collection-events_null-resource_9F908E27
    resource "null_resource" "collection-events_null-resource_9F908E27" {
        id = "7083867980005228814"
    }

  # null_resource.pocketeventbridge_listapievents_nullresource_0986E948 has moved to null_resource.list-api-events_null-resource_D711C801
    resource "null_resource" "list-api-events_null-resource_D711C801" {
        id = "1177664838478028438"
    }

  # null_resource.pocketeventbridge_premiumpurchase_nullresource_6D67F378 has moved to null_resource.premium-purchase_null-resource_E2C3B0AC
    resource "null_resource" "premium-purchase_null-resource_E2C3B0AC" {
        id = "8590974618707730681"
    }

  # null_resource.pocketeventbridge_prospectevents_nullresource_92CE41FC has moved to null_resource.prospect-events_null-resource_BF542108
    resource "null_resource" "prospect-events_null-resource_BF542108" {
        id = "1286103112814733777"
    }

  # null_resource.pocketeventbridge_shareablelistevents_nullresource_E91C89D8 has moved to null_resource.shareable-list-events_null-resource_78AB9CC2
    resource "null_resource" "shareable-list-events_null-resource_78AB9CC2" {
        id = "7244420153938391428"
    }

  # null_resource.pocketeventbridge_shareablelistitemevents_nullresource_B57BD2A5 has moved to null_resource.shareable-list-item-events_null-resource_46056FE2
    resource "null_resource" "shareable-list-item-events_null-resource_46056FE2" {
        id = "7377342030826013425"
    }

  # null_resource.user-api-events will be created
  + resource "null_resource" "user-api-events" {
      + id = (known after apply)
    }

  # null_resource.pocketeventbridge_userapievents_nullresource_7F96C768 has moved to null_resource.user-api-events_null-resource_C0C836FA
    resource "null_resource" "user-api-events_null-resource_C0C836FA" {
        id = "4119566737246291003"
    }

  # null_resource.user-registration will be created
  + resource "null_resource" "user-registration" {
      + id = (known after apply)
    }

  # null_resource.pocketeventbridge_userregistration_nullresource_F1C77D27 has moved to null_resource.user-registration_null-resource_B04CACC3
    resource "null_resource" "user-registration_null-resource_B04CACC3" {
        id = "1347031598725150988"
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be updated in-place
  # (moved from pagerduty_service.pocketeventbridge_pagerduty_pagerdutycritical_22817B42)
  ~ resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      ~ acknowledgement_timeout = "600" -> "1800"
        id                      = "PDZUG2E"
        name                    = "PocketEventBridge-Prod-PagerDuty-Critical"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be updated in-place
  # (moved from pagerduty_service.pocketeventbridge_pagerduty_pagerdutynoncritical_333AFE25)
  ~ resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      ~ acknowledgement_timeout = "600" -> "1800"
        id                      = "PH8FGF4"
        name                    = "PocketEventBridge-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PDZUG2E"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PH8FGF4"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PDZUG2E"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PH8FGF4"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8" {
      - html_url        = "https://mozilla.pagerduty.com/services/PDZUG2E/integrations/PTQTW8M" -> null
      - id              = "PTQTW8M" -> null
      - integration_key = "7427f9a5d3854a02c0b8c30b7030a2d3" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PDZUG2E" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7" {
      - html_url        = "https://mozilla.pagerduty.com/services/PH8FGF4/integrations/P94HUH9" -> null
      - id              = "P94HUH9" -> null
      - integration_key = "0172408fce6c490ec0a6a42ce381b946" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PH8FGF4" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715" {
      - html_url        = "https://mozilla.pagerduty.com/services/PDZUG2E/integrations/PPE5VWZ" -> null
      - id              = "PPE5VWZ" -> null
      - integration_key = "e966b75898e24b01d01e42104f6221aa" -> null
      - name            = "Sentry" -> null
      - service         = "PDZUG2E" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0" {
      - html_url        = "https://mozilla.pagerduty.com/services/PH8FGF4/integrations/P5VWU4J" -> null
      - id              = "P5VWU4J" -> null
      - integration_key = "0773820ae3694f09d069d4f5cbf06ec0" -> null
      - name            = "Sentry" -> null
      - service         = "PH8FGF4" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

Plan: 8 to add, 3 to change, 6 to destroy.
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715: Destroying... [id=PPE5VWZ]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0: Destroying... [id=P5VWU4J]
null_resource.user-registration: Creating...
null_resource.user-api-events: Creating...
null_resource.user-registration: Creation complete after 0s [id=5327083105882550525]
null_resource.user-api-events: Creation complete after 0s [id=8253668488401468656]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical:43fcae3a-4102-4d05-9762-2a77e739c417]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical:79ed7c1b-2cb9-4cf2-b1d9-18f178abe858]
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Modifying... [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C: Modifications complete after 0s [id=PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7: Destroying... [id=P94HUH9]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8: Destroying... [id=PTQTW8M]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Modifying... [id=PDZUG2E]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Modifying... [id=PH8FGF4]
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0: Destruction complete after 1s
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715: Destruction complete after 1s
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8: Destruction complete after 1s
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Modifications complete after 1s [id=PH8FGF4]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Modifications complete after 1s [id=PDZUG2E]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7: Destruction complete after 1s
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PUTEYG6]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 0s [id=PQHTY3G]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 0s [id=PN85XRT]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=P2MWVMD]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical:1e28704a-6e6f-4a9a-9e11-457f3af5f97f]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical:c6031a7a-308a-4840-a945-1551f5fe6974]

Apply complete! Resources: 8 added, 3 changed, 6 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"2401b752-3ab8-44ba-8335-477a51953e3c","JobName":"pocket-event-bridge_infrastructure_apply_prod","PRNumber":94,"Program":"tfcmt","SHA1":"2f57265c0c5cee1fb38219368cd199dc5d75aab2","Target":"pocket-event-bridge-cdk","Vars":{}} -->